// Таблицы скоростей переключения передач.

#ifndef _GEARS_TABLES_H_
	#define _GEARS_TABLES_H_

	//================ Скорости для переключения передач от ДПДЗ ==============
	uint8_t Gear_1_2[] = {15, 15, 15, 15, 17, 21, 25, 26, 28, 29, 29};										
	uint8_t Gear_2_1[] = {11, 11, 11, 11, 13, 17, 20, 20, 22, 23, 23};										
	uint8_t Gear_2_3[] = {25, 25, 25, 27, 29, 36, 41, 48, 48, 53, 52};										
	uint8_t Gear_3_2[] = {18, 21, 21, 23, 25, 32, 37, 43, 40, 44, 43};										
	uint8_t Gear_3_4[] = {41, 41, 41, 56, 62, 74, 78, 87, 94, 96, 105};										
	uint8_t Gear_4_3[] = {38, 36, 36, 51, 57, 69, 72, 76, 75, 75, 84};										
	uint8_t Gear_4_5[] = {78, 78, 78, 93, 105, 105, 105, 118, 132, 132, 130};										
	uint8_t Gear_5_4[] = {74, 74, 74, 88, 100, 100, 100, 109, 117, 117, 115};										

	// Сетки стандартных осей.
	int16_t TempGridB3[] = {-30, -20, -10, 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150};

	// Давление схватывания тормоза B3 от ДПДЗ при нормальной температуре 70 градусов.
	uint8_t StartPressureB3Array[] = {
	    67, 68, 71, 72, 73, 75, 75, 76, 76, 76, 77};
	//  0   10  20  30  40  50  60  70  80, 90, 100

	// Корекция схватывания тормоза B3 от температуры.
	int16_t B3TempCorrGraph[] = {
		-3, -3, -3, -3, -3, -2, -2, -2, -1,  0, 0, 1, 1, 2, 3, 3, 4, 4, 5};
	//	-3  -2  -1   0   1   2   3   4   5   6  7  8  9  10 11 12 13 14 15 	(x10)

	// Дллина одного шага времени на переключение от ДПДЗ.
	uint16_t GearChangeStepArray[] = {
		100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};
	//  0    10   20   30   40   50   60   70   80,  90,  100	

	// Задержка после переключения передач от ДПДЗ.
	uint16_t AfterChangeDelayArray[] = {
		1500, 1500, 1400, 1400, 1400, 1300, 1300, 1200, 1200, 1000, 1000};
	//  0	  10    20    30    40    50    60    70    80,   90,   100			
#endif