// Таблицы скоростей переключения передач.

#ifndef _GEARS_TABLES_H_
	#define _GEARS_TABLES_H_

	//================ Скорости для переключения передач от ДПДЗ ==============
	uint16_t Gear_1_2[] = {14, 15, 15, 15, 15, 15, 16, 17, 21, 25, 26, 28, 29, 29};													
	uint16_t Gear_2_1[] = {10, 11, 11, 11, 11, 11, 12, 13, 17, 20, 20, 22, 23, 23};													
	uint16_t Gear_2_3[] = {25, 26, 26, 27, 28, 29, 31, 32, 36, 41, 48, 48, 53, 52};													
	uint16_t Gear_3_2[] = {21, 22, 22, 23, 24, 25, 27, 28, 32, 37, 43, 40, 44, 43};													
	uint16_t Gear_3_4[] = {42, 45, 45, 45, 45, 50, 58, 62, 74, 78, 87, 94, 98, 101};													
	uint16_t Gear_4_3[] = {38, 41, 41, 41, 41, 46, 53, 57, 69, 72, 76, 75, 77, 80};													
	uint16_t Gear_4_5[] = {75, 78, 78, 78, 78, 82, 93, 105, 105, 105, 118, 130, 130, 130};													
	uint16_t Gear_5_4[] = {69, 72, 72, 72, 72, 76, 87, 99, 99, 99, 109, 115, 115, 115};													

	// Дллина одного шага времени на переключение от ДПДЗ.
	uint16_t GearChangeStepArray[] = {
		100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};
	//  0    5    10   15   20   25   30   40   50   60   70   80,  90,  100

	// Задержка после переключения передач от ДПДЗ.
	uint16_t AfterChangeDelayArray[] = {
		1500, 1400, 1400, 1300, 1300, 1300, 1300, 1300, 1200, 1200, 1200, 1200, 1200, 1200};
	//  0     5     10    15    20    25    30    40    50    60    70    80,   90,   100
#endif