// Таблицы скоростей переключения передач.

#ifndef _GEARS_TABLES_H_
	#define _GEARS_TABLES_H_

	//================ Скорости для переключения передач от ДПДЗ ==============
	uint8_t Gear_1_2[] = {21, 23, 29, 33, 33, 33, 33, 37, 40, 40, 40};										
	uint8_t Gear_2_1[] = {18, 20, 26, 30, 30, 30, 29, 32, 35, 35, 35};										

	uint8_t Gear_2_3[] = {32, 36, 45, 51, 51, 51, 51, 59, 65, 66, 66};										
	uint8_t Gear_3_2[] = {29, 33, 42, 48, 48, 48, 48, 55, 58, 58, 58};										

	uint8_t Gear_3_4[] = {49, 55, 68, 78, 78, 78, 82, 92, 99, 101, 105};										
	uint8_t Gear_4_3[] = {46, 51, 64, 74, 73, 74, 77, 82, 81, 81, 85};										

	uint8_t Gear_4_5[] = {75, 80, 97, 111, 111, 111, 111, 125, 139, 139, 139};										
	uint8_t Gear_5_4[] = {72, 77, 94, 107, 107, 107, 107, 117, 125, 125, 125};

	// Время переключения передач от ДПДЗ.
	uint16_t GearChangeTime[] = {
		500, 480, 460, 440, 420, 400, 380, 360, 340, 320, 300};
	//  0    10   20   30   40   50   60   70   80,  90,  100	
#endif