// Таблицы скоростей переключения передач.

#ifndef _GEARS_TABLES_H_
	#define _GEARS_TABLES_H_

	//================ Скорости для переключения передач от ДПДЗ ==============
	uint16_t Gear_1_2[] = {15, 15, 15, 16, 17, 18, 19, 20, 22, 24, 26, 28, 30, 30};							
	uint16_t Gear_2_1[] = {12, 11, 11, 12, 13, 14, 15, 16, 18, 19, 20, 22, 24, 24};							
	uint16_t Gear_2_3[] = {28, 29, 29, 30, 31, 32, 33, 35, 36, 42, 46, 48, 50, 52};							
	uint16_t Gear_3_2[] = {25, 25, 25, 26, 27, 28, 28, 30, 31, 36, 39, 40, 41, 43};							
	uint16_t Gear_3_4[] = {46, 46, 47, 48, 50, 52, 56, 62, 72, 78, 86, 92, 96, 101};							
	uint16_t Gear_4_3[] = {43, 42, 43, 44, 46, 47, 51, 56, 65, 69, 75, 78, 79, 80};							
	uint16_t Gear_4_5[] = {75, 78, 78, 78, 80, 85, 90, 100, 105, 110, 115, 120, 125, 130};							
	uint16_t Gear_5_4[] = {70, 72, 72, 72, 74, 78, 83, 92, 97, 101, 105, 108, 110, 115};							
													

	// Дллина одного шага времени на переключение от ДПДЗ.
	uint16_t GearChangeStepArray[] = {
		100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};
	//  0    5    10   15   20   25   30   40   50   60   70   80,  90,  100

	// Задержка после переключения передач от ДПДЗ.
	uint16_t AfterChangeDelayArray[] = {
		1500, 1400, 1400, 1300, 1300, 1300, 1300, 1300, 1200, 1200, 1200, 1200, 1200, 1200};
	//  0     5     10    15    20    25    30    40    50    60    70    80,   90,   100
#endif