// Таблицы скоростей переключения передач.

#ifndef _GEARS_TABLES_H_
	#define _GEARS_TABLES_H_

	//================ Скорости для переключения передач от ДПДЗ ==============
	uint16_t Gear_1_2[] = {13, 15, 15, 15, 15, 16, 18, 20, 22, 24, 26, 28, 28, 28, 30, 32, 32, 32, 32, 32, 32};
	uint16_t Gear_2_1[] = {9, 11, 11, 11, 11, 12, 13, 15, 17, 19, 21, 22, 22, 22, 23, 24, 24, 24, 24, 24, 24};
	uint16_t Gear_2_3[] = {24, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 45, 48, 50, 50, 50, 50, 50, 50, 50};
	uint16_t Gear_3_2[] = {19, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 39, 40, 42, 42, 42, 42, 42, 42, 42};
	uint16_t Gear_3_4[] = {43, 44, 44, 44, 46, 48, 50, 54, 58, 62, 66, 70, 74, 80, 84, 85, 87, 90, 92, 94, 94};
	uint16_t Gear_4_3[] = {39, 40, 40, 40, 41, 42, 44, 48, 52, 54, 57, 60, 62, 66, 68, 69, 71, 72, 72, 74, 74};
	uint16_t Gear_4_5[] = {75, 78, 78, 79, 80, 82, 84, 86, 90, 95, 100, 105, 110, 112, 115, 117, 120, 122, 125, 127, 130};
	uint16_t Gear_5_4[] = {70, 72, 72, 73, 74, 75, 77, 78, 82, 87, 92, 96, 101, 102, 105, 106, 108, 109, 110, 112, 115};

	// Дллина одного шага времени на переключение от ДПДЗ.
	uint16_t GearChangeStepArray[] = {
		100, 100, 100, 100, 95, 90, 85, 80, 75, 70, 65, 65, 60, 60, 55, 55, 50, 50, 50, 50, 50};
	//  0    5    10   15   20  25  30  35  40  45  50  55  60  65  70  75  80  85  90  95  100

	// Задержка после переключения передач от ДПДЗ.
	uint16_t AfterChangeDelayArray[] = {
		800, 800, 750, 700, 700, 700, 650, 650, 650, 600, 600, 600, 550, 550, 550, 550, 500, 500, 500, 500, 500};
	//  0     5   10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Обороты переключения по передачам при газе в пол.
	uint16_t GearUpRPM[] = {5000, 5200, 5400, 5400, 9999};
	//						1     2     3     4     4
	
	int16_t GearDownRPM[] = {0, 2700, 3000, 3000, 3000};
	//						 1  2     3     4     5

	// Пауза после переключения по передачам при газе в пол.
	uint16_t GearUpDelay[] = {500, 600, 700, 800, 800};
	//						  1    2    3    4    5
	// Пауза после переключения по передачам при газе в пол.
	uint16_t GearDownDelay[] = {500,  500, 500, 500, 500};
	//						    1     2    3    4    5

#endif