// Положение селектора АКПП.

#ifndef _SELECTOR_H_
	#define _SELECTOR_H_

	void selector_init();
	uint8_t get_selector_byte();
	void selector_position();
	void engine_n_break_state();

#endif


/* 
	Режимы селектора АКПП

№ |(№ бита) | Значение  |	- Положение селектора.
  |		    | регистра  |
----------------------------------------------------------------
0 |  (-)	|	0   	|	- I (Начальное значение при запуске)
1 |  (0)	|	1   	|	- P
2 |  (1)	|	2   	|	- R
3 |  (2)	|	4   	|	- N
4 |  (3)	|	8   	|	- D
5 |  (6)	|	40  	|	- D4
6 |  (4)	|	16  	|	- 3
7 |  (5)	|	32  	|	- 2
8 |  (7)	|	160 	|	- L
9 |  (-)	|	-   	|	- Error

*/