// Значения от датчиков и значения для ШИМ задаются в "сыром" виде,
// 0-1023 и 0-255 соответственно.

#ifndef _TCUDATA_TABLES_H_
	#define _TCUDATA_TABLES_H_

	// Сетки стандартных осей, длина 21 и 37 элементов или 42 и 74 байта.
	int16_t TPSGrid[] = {0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100};
	int16_t TempGrid[] = {-30, -25, -20, -15, -10, -5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 120};
	int16_t DeltaRPMGrid[] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180, 200, 220, 240, 260, 280, 300, 320, 340, 360, 380, 400};
	
	//=================================== Датчики =============================
	// ДПДЗ (показания АЦП).
	int16_t TPSGraph[] = {
		97, 135, 173, 211, 249, 288, 326, 364, 402, 440, 478, 516, 554, 592, 630, 669, 707, 745, 783, 821, 859};

	// Температура масла (показания АЦП).
	int16_t OilTempGraph[] = {
		1005, 999, 992, 982, 972, 953, 934, 904, 873, 834, 795, 753, 711, 667, 623, 580, 536, 494, 452, 414, 376, 344, 311, 284, 256, 233, 210, 191, 172, 156, 140};

	//==================================== SLT ===============================
	// Линейное давление SLT от ДПДЗ.
	uint16_t SLTGraph[] = {
		216, 260, 308, 352, 400, 460, 520, 580, 600, 640, 680, 720, 760, 800, 800, 800, 800, 800, 800, 800, 800};    // 28.11.2025																					

	// Коррекция в % давления SLT от температуры.
	int16_t SLTTempCorrGraph[] = {
		-133, -123, -113, -102, -92, -82, -75, -65, -60, -55, -51, -51, -41, -41, -31, -31, -20, -20, -10, -10, 0, 31, 61, 102, 143, 184, 225, 256, 256, 256, 256};    // 28.11.2025																					

	//==================================== SLN ===============================
	// Давление SLN от ДПДЗ (Величина сброса давления).
	uint16_t SLNGraph[] = {
		580, 504, 424, 328, 260, 220, 200, 180, 160, 140, 120, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};    // 28.11.2025																					

	// Коррекция в % давления SLN от температуры.
	int16_t SLNTempCorrGraph[] = {
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};    // 01.12.2025																					

	//==================================== Gear 2 =============================
	// Давление SLU включения второй передачи (SLU B3) от ДПДЗ.
	uint16_t SLUGear2Graph[] = {
		308, 299, 303, 315, 321, 342, 350, 368, 364, 364, 368, 380, 380, 368, 376, 376, 386, 386, 390, 392, 400};    // 28.11.2025																					

	// Корекция в % давления в тормозе второй передачи B3 от температуры.
	int16_t SLUGear2TempCorrGraph[] = {
		-286, -281, -281, -276, -276, -271, -266, -261, -272, -268, -230, -222, -205, -177, -154, -136, -127, -103, -67, -42, -2, 12, 31, 72, 108, 134, 139, 144, 144, 144, 149};    // 28.11.2025																					

	// Значение автоадаптации по ДПДЗ включения второй передачи.
	int16_t SLUGear2TPSAdaptGraph[21] = {0};

	// Значение автоадаптации по температуре включения второй передачи.
	int16_t SLUGear2TempAdaptGraph[31] = {0};

	// Опережение по оборотам реактивации второй передачи.
	int16_t Gear2AdvGraph[] = {
		0, 581, 448, 436, 497, 597, 440, 695, 550, 539, 607, 536, 824, 700, 700, 716, 704, 720, 700, 700, 700};    // 28.11.2025																					

	// Коррекция по температуре.
	int16_t Gear2AdvTempCorrGraph[] = {
		100, 100, 100, 100, 100, 100, 75, 75, 50, 50, 25, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};    // 28.11.2025																					

	// Значение автоадаптации оборотов реактивации второй передачи.
	int16_t Gear2AdvAdaptGraph[21] = {0};

	// Значение автоадаптации оборотов по температуре.
	int16_t Gear2AdvTempAdaptGraph[31] = {0};

	//==================================== Gear 3 =============================
	// Давление SLU включения третьей передачи (SLU B2) от ДПДЗ.
	uint16_t SLUGear3Graph[] = {
		339, 329, 333, 347, 353, 376, 385, 405, 400, 400, 405, 418, 418, 405, 414, 414, 425, 425, 429, 431, 440};    // 28.11.2025																					

	// Время удержания SLU от ДПДЗ при включении третьей передачи.
	uint16_t SLUGear3DelayGraph[] = {
		459, 425, 508, 553, 453, 456, 471, 470, 470, 495, 425, 425, 425, 425, 425, 425, 375, 375, 275, 275, 275};    // 28.11.2025																					

	// Корекция времени удержания SLU при включении третьей передачи от температуры (мс).
	int16_t SLUG3DelayTempCorrGraph[] = {
		-100, -100, -100, -100, -100, -100, -100, -100, -114, -68, -98, -130, -67, -73, -50, -42, -34, -3, 15, 4, -4, 10, 19, 25, 25, 25, 50, 50, 50, 50, 50};    // 28.11.2025																					

	// Значение автоадаптации по ДПДЗ включения третьей передачи.
	int16_t SLUGear3TPSAdaptGraph[21] = {0};
	// Значение автоадаптации по температуре включения третьей передачи.
	int16_t SLUGear3TempAdaptGraph[31] = {0};

	// Давление SLN при включении третьей передачи.
	uint16_t SLNGear3Graph[] = {
		580, 504, 396, 308, 252, 220, 200, 180, 160, 140, 120, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};    // 28.11.2025																					

	// Смещение времени включения SLN при включении третьей передачи.
	int16_t SLNGear3OffsetGraph[] = {
	    0, 25, 25, 45, 70, 100, 175, 250, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300};    // 28.11.2025																					


	// Длина одного шага времени на переключение от ДПДЗ.
	uint16_t GearChangeStepArray[] = {
		100, 100, 90, 80, 70, 65, 60, 60, 55, 55, 55, 50, 50, 50, 50, 50, 50, 45, 45, 40, 40};
	//  0    5    10  15  20  25  30  35  40  45  50  55  60  65  70  75  80  85  90  95  100

	//================ Скорости для переключения передач от ДПДЗ ==============
	uint8_t Gear_2_1[] = {9, 10, 10, 11, 13, 14, 19, 20, 22, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24};
	uint8_t Gear_1_2[] = {14, 15, 15, 16, 18, 20, 26, 28, 32, 34, 35, 36, 36, 36, 36, 36, 36, 36, 36, 36, 36};

	uint8_t Gear_3_2[] = {18, 20, 21, 22, 24, 28, 34, 36, 40, 42, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44};
	uint8_t Gear_2_3[] = {24, 26, 27, 28, 30, 36, 44, 46, 50, 54, 58, 60, 62, 62, 62, 62, 62, 62, 62, 62, 62};

	uint8_t Gear_4_3[] = {37, 37, 38, 40, 46, 48, 56, 58, 62, 64, 66, 68, 70, 70, 70, 70, 70, 70, 70, 70, 70};
	uint8_t Gear_3_4[] = {44, 45, 46, 48, 54, 58, 66, 70, 74, 78, 86, 92, 96, 98, 99, 99, 99, 99, 99, 99, 99};

	uint8_t Gear_5_4[] = {68, 70, 71, 72, 72, 75, 80, 85, 95, 98, 106, 114, 120, 120, 120, 120, 122, 122, 122, 124, 124};
	uint8_t Gear_4_5[] = {75, 77, 78, 80, 80, 85, 90, 100, 105, 110, 120, 130, 140, 140, 140, 140, 142, 142, 142, 144, 144};

#endif