// Значения от датчиков и значения для ШИМ задаются в "сыром" виде,
// 0-1023 и 0-255 соответственно.

#ifndef _TCUDATA_TABLES_H_
	#define _TCUDATA_TABLES_H_

	// Сетки стандартных осей, длина 21 и 37 элементов или 42 и 74 байта.
	int16_t TPSGrid[] = {0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100};
	int16_t TempGrid[] = {-30, -25, -20, -15, -10, -5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 120, 125, 130, 135, 140, 145, 150};
	
	//=================================== Датчики =============================
	// Температура масла (показания АЦП).
	int16_t OilTempGraph[] = {
		1005, 999, 992, 982, 972, 953, 934, 904, 873, 834, 795, 753, 711, 667, 623, 580, 536, 494, 452, 414, 376, 344, 311, 284, 256, 233, 210, 191, 172, 156, 140, 127, 114, 104, 93, 85, 77};
	//	-30	  -25  -20  -15  -10  -5   0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100  105  110  115  120  125  130  135  140 145 150

	// ДПДЗ (показания АЦП).
	int16_t TPSGraph[] = {
		97, 135, 173, 211, 249, 288, 326, 364, 402, 440, 478, 516, 554, 592, 630, 669, 707, 745, 783, 821, 859};
	//	0   5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	//================================== Соленоиды ============================
	// Линейное давление SLT от ДПДЗ.
	uint16_t SLTGraph[] = {
		54, 70, 80, 90, 100, 115, 130, 145, 150, 160, 170, 180, 190, 200, 200, 200, 200, 200, 200, 200, 200};	// 17.04.2025
	//  0   5   10  15  20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Коррекция в % давления SLT от температуры.
	int16_t SLTTempCorrGraph[] = {
		-10, -10, -10, -9, -8, -8, -7, -6, -6, -6, -5, -5, -4, -4, -3, -3, -2, -2, -1, -1, 0, 1, 2, 3, 3, 4, 4,  5,  5,  5,  6,  6,  7,  7,  7,  8,  8};	// 17.04.2025
	//	-30	 -25  -20  -15 -10 -5   0   5  10  15  20  25  30  35  40  45  50  55  60  65  70 75 80 85 90 95 100 105 110 115 120 125 130 135 140 145 150

	// Давление SLN от ДПДЗ (Величина сброса давления).
	uint16_t SLNGraph[] = {
		135, 120, 110, 100, 90, 65, 45, 32, 20, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}; 	// 17.04.2025
	//  0    5    10   15   20  25  30  35  40  45  50  55 60 65 70 75 80 85 90 95 100

	// Давление SLU включения второй передачи (SLU B3) от ДПДЗ.
	uint16_t SLUGear2Graph[] = {
		55, 72, 75, 80, 84, 88, 93, 97, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124}; 	// 17.04.2025
	//  0   5   10  15  20  25  30  35  40   45   50   55   60   65   70   75   80   85   90   95   100

	// Корекция в % давления в тормозе второй передачи B3 от температуры.
	int16_t SLUGear2TempCorrGraph[] = {
		-28, -28, -27, -27, -26, -25, -24, -23, -22, -21, -20, -19, -18, -17, -14, -11, -9, -6, -2, -1, 0, 2, 4, 7, 10, 13, 15, 18, 21, 24, 26, 29, 33, 37, 42, 46, 50}; 	// 17.04.2025
	//  -30  -25  -20  -15  -10  -5    0    5    10   15   20   25   30   35   40   45  50   55  60  65 70 75 80 85 90  95  100 105 110 115 120 125 130 135 140 145 150

	// Дельта оборотов включения второй передачи после ХХ от ДПДЗ.
	uint16_t Gear2DeltaRPM[] = {
	    250, 320, 380, 470, 600, 650, 700, 750, 800, 800, 800, 800, 800, 800, 800, 800, 800, 800, 800, 800, 800}; 	// 17.04.2025
	//  0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Смещение графика снижения SLU от ДПДЗ при включении третьей передачи.
	int16_t SLUGear3OffsetGraph[] = {
		-8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8, -8};	// 17.04.2025
	//   0   5   10  15  20  25  30  35  40  45  50  55  60  65  70  75  80  85  90  95  100

	// Значение автоадаптации по ДПДЗ включения второй передачи.
	int16_t SLUGear2TPSAdaptGraph[21] = {0};

	// Значение автоадаптации по температуре включения второй передачи.
	int16_t SLUGear2TempAdaptGraph[37] = {0};

#endif