// Значения от датчиков и значения для ШИМ задаются в "сыром" виде,
// 0-1023 и 0-255 соответственно.

#ifndef _TCUDATA_TABLES_H_
	#define _TCUDATA_TABLES_H_

	// Сетки стандартных осей.
	int16_t TempGrid[] = {-30, -20, -10, 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150};
	int16_t TPSGrid[] = {0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100};

	//=================================== Датчики =============================
	// Температура масла (показания АЦП).
	int16_t OilTempGraph[] = {
		1005, 992, 972, 934, 873, 795, 711, 623, 536, 452, 376, 311, 256, 210, 172, 140, 114, 93, 77};
	//	-30	  -20  -10  0    10   20   30   40   50   60   70   80   90   100  110  120  130  140 150

	// ДПДЗ (показания АЦП).
	int16_t TPSGraph[] = {
		0, 55, 110, 165, 220, 275, 330, 385, 440, 495, 550};
	//	0  10  20   30   40   50   60   70   80   90   100

	//================================== Соленоиды ============================
	// Линейное давление SLT от ДПДЗ.
	int16_t SLTGraph[] = {
		102, 128, 140, 153, 166, 191, 204, 204, 204, 204, 217};
	//  0    10   20   30   40   50   60   70   80,  90,  100

	// Корекция давления от температуры.
	int16_t TempCorrGraph[] = {
		-26, -20, -18, -15, -13, -10, -8, -5, -3, -3, 0, 3, 5, 5, 8, 10, 13, 15, 18};
	//	-3	 -2   -1    0    1    2    3   4   5   6  7  8  9  10 11 12  13  14  15 	(x10)

#endif