// Значения от датчиков и значения для ШИМ задаются в "сыром" виде,
// 0-1023 и 0-255 соответственно.

#ifndef _TCUDATA_TABLES_H_
	#define _TCUDATA_TABLES_H_

	// Сетки стандартных осей, длина 21 и 37 элементов или 42 и 74 байта.
	int16_t TPSGrid[] = {0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100};
	int16_t TempGrid[] = {-30, -25, -20, -15, -10, -5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 120};
	int16_t DeltaRPMGrid[] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180, 200, 220, 240, 260, 280, 300, 320, 340, 360, 380, 400};
	
	//=================================== Датчики =============================
	// Температура масла (показания АЦП).
	int16_t OilTempGraph[] = {
		1005, 999, 992, 982, 972, 953, 934, 904, 873, 834, 795, 753, 711, 667, 623, 580, 536, 494, 452, 414, 376, 344, 311, 284, 256, 233, 210, 191, 172, 156, 140};
	//	-30	  -25  -20  -15  -10  -5   0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100  105  110  115  120

	// ДПДЗ (показания АЦП).
	int16_t TPSGraph[] = {
		97, 135, 173, 211, 249, 288, 326, 364, 402, 440, 478, 516, 554, 592, 630, 669, 707, 745, 783, 821, 859};
	//	0   5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	//==================================== SLT ===============================
	// Линейное давление SLT от ДПДЗ.
	uint16_t SLTGraph[] = {
		216, 260, 308, 352, 400, 460, 520, 580, 600, 640, 680, 720, 760, 800, 800, 800, 800, 800, 800, 800, 800};    // 21.07.2025																					
	//  0    5    10   15   20    25  30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Коррекция в % давления SLT от температуры.
	int16_t SLTTempCorrGraph[] = {
		-13, -12, -11, -10, -9, -8, -7, -6, -6, -6, -5, -5, -4, -4, -3, -3, -2, -2, -1, -1, 0, 3, 6, 10, 14, 18, 22, 25, 25, 25, 25};    // 21.07.2025																					
	//	-30	 -25  -20  -15  -10 -5   0   5   10  15  20  25  30  35  40  45  50  55  60  65 70 75 80 85  90  95  100 105 110 115 120

	//==================================== SLN ===============================
	// Давление SLN от ДПДЗ (Величина сброса давления).
	uint16_t SLNGraph[] = {
		580, 504, 424, 328, 260, 220, 200, 180, 160, 140, 120, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};    // 21.07.2025																					
	//  0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	//==================================== Gear 2 =============================
	// Давление SLU включения второй передачи (SLU B3) от ДПДЗ.
	uint16_t SLUGear2Graph[] = {
		292, 288, 300, 308, 312, 340, 346, 364, 372, 364, 368, 376, 376, 368, 376, 376, 386, 386, 390, 392, 400};    // 21.07.2025																					
	//  0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Корекция в % давления в тормозе второй передачи B3 от температуры.
	int16_t SLUGear2TempCorrGraph[] = {
		-20, -20, -20, -20, -20, -20, -20, -20, -20, -20, -17, -13, -12, -10, -9, -8, -7, -6, -5, -3, 0, 13, 14, 15, 16, 16, 16, 16, 16, 16, 16};    // 21.07.2025																					
	//  -30  -25  -20  -15  -10  -5    0    5    10   15   20   25   30   35   40   45   50   55  60  65 70 75 80 85  90  95  100 105 110 115 120

	// Значение автоадаптации по ДПДЗ включения второй передачи.
	int16_t SLUGear2TPSAdaptGraph[21] = {0};

	// Значение автоадаптации по температуре включения второй передачи.
	int16_t SLUGear2TempAdaptGraph[37] = {0};

	// Опережение по оборотам реактивации второй передачи.
	int16_t Gear2AdvGraph[] = {
		0, 0, 0, 0, 0, 0, 2, 4, 6, 8, 10, 10, 10, 10, 10, 10, 10, 10, 10, 12, 14};    // 21.07.2025																					
	//   0   5  10  15  20  25 30 35 40 45 50 	 55  60  65  70  75  80  85  90  95  100

	// Значение автоадаптации оборотов реактивации второй передачи.
	int16_t Gear2AdvAdaptGraph[21] = {0};

	//==================================== Gear 3 =============================
	// Давление SLU включения третьей передачи (SLU B2) от ДПДЗ.
	uint16_t SLUGear3Graph[] = {
		308, 340, 349, 358, 368, 400, 407, 427, 427, 427, 432, 432, 432, 427, 432, 437, 443, 448, 453, 455, 460};    // 21.07.2025																					
	//  0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Время удержания SLU от ДПДЗ при включении третьей передачи.
	uint16_t SLUGear3DelayGraph[] = {
		500, 500, 500, 500, 500, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 400, 400, 300, 300, 300};    // 21.07.2025																					
	//  0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Корекция времени удержания SLU при включении третьей передачи от температуры (мс).
	int16_t SLUG3DelayTempCorrGraph[] = {
		-125, -125, -125, -125, -125, -125, -125, -125, -125, -100, -100, -100, -75, -75, -50, -50, -50, -25, -25, 0, 0, 0, 25, 25, 25, 25, 50, 50, 50, 50, 50};    // 07.10.2025																					
	//  -30  -25  -20  -15  -10  -5    0    5    10   15   20   25   30   35   40   45   50   55  60  65 70 75 80 85  90  95  100 105 110 115 120

	// Значение автоадаптации по ДПДЗ включения третьей передачи.
	int16_t SLUGear3TPSAdaptGraph[21] = {0};
	// Значение автоадаптации по температуре включения третьей передачи.
	int16_t SLUGear3TempAdaptGraph[37] = {0};

	// Давление SLN при включении третьей передачи.
	uint16_t SLNGear3Graph[] = {
		584, 500, 432, 348, 292, 220, 188, 164, 148, 128, 116, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100};    // 21.07.2025																					
	//  0    5    10   15   20   25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

	// Смещение времени включения SLN при включении третьей передачи.
	int16_t SLNGear3OffsetGraph[] = {
	    0, 25, 50, 50, 50, 100, 175, 250, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300};    // 21.07.2025																					
	//  0  5   10  15  20  25   30   35   40   45   50   55   60   65   70   75   80   85   90   95   100

#endif