// Значения от датчиков и значения для ШИМ задаются в "сыром" виде,
// 0-1023 и 0-255 соответственно.

#ifndef _TCUDATA_TABLES_H_
	#define _TCUDATA_TABLES_H_

	// Сетки стандартных осей.
	int16_t TempGrid[] = {-30, -20, -10, 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150};
	int16_t TPSGrid[] = {0, 5, 10, 15, 20, 25, 30, 40, 50, 60, 70, 80, 90, 100};

	//=================================== Датчики =============================
	// Температура масла (показания АЦП).
	int16_t OilTempGraph[] = {
		1005, 992, 972, 934, 873, 795, 711, 623, 536, 452, 376, 311, 256, 210, 172, 140, 114, 93, 77};
	//	-30	  -20  -10  0    10   20   30   40   50   60   70   80   90   100  110  120  130  140 150

	// ДПДЗ (показания АЦП).
	int16_t TPSGraph[] = {
		88, 123, 158, 194, 230, 264, 297, 370, 439, 509, 581, 649, 720, 787};
	//	0   5    10   15   20   25   30   40   50   60   70   80   90   100

	//================================== Соленоиды ============================
	// Линейное давление SLT от ДПДЗ.
	uint16_t SLTGraph[] = {
		64, 69, 89, 102, 115, 127, 140, 166, 191, 204, 204, 204, 204, 217};
	//  0   5   10  15   20   25   30   40   50   60   70   80,  90,  100

	// Коррекция давления SLT от температуры.
	int16_t SLTTempCorrGraph[] = {
		-26, -20, -18, -15, -13, -10, -8, -5, -3, -3, 0, 3, 5, 5, 8, 10, 13, 15, 18};
	//	-3	 -2   -1    0    1    2    3   4   5   6  7  8  9  10 11 12  13  14  15 	(x10)

	// Давление гидроаккумуляторов SLN от ДПДЗ.
	uint16_t SLNGraph[] = {
		60, 65, 70, 75, 80, 85, 90, 100, 110, 120, 130, 140, 150, 160};
	//  0   5   10  15  20  25  30  40   50   60   70   80,  90,  100

	// Давление включения и работы второй передачи (SLU B3) от ДПДЗ.
	uint16_t SLUB3Graph[] = {
	    66, 66, 66, 67, 68, 70, 72, 74, 75, 76, 77, 79, 81, 84};
	//  0   5   10  15  20  25  30  40  50  60  70  80, 90, 100

	// Давление включения третьей передачи (SLU B2) от ДПДЗ.
	uint16_t SLUB2Graph[] = {
		82, 83, 84, 85, 86, 86, 86, 86, 86, 87, 88, 90, 92, 96};
	//  0   5   10  15  20  25  30  40  50  60  70  80, 90, 100

	// Корекция давления тормоза B3 от температуры.
	int16_t B3TempCorrGraph[] = {
		-4, -4, -4, -4, -4, -3, -3, -2, -1,  0, 0, 0, 1, 2, 3, 3, 4, 4, 5};
	//	-3  -2  -1   0   1   2   3   4   5   6  7  8  9  10 11 12 13 14 15 	(x10)

	uint8_t SLTB2Add = 40;	// Добавка в SLT для переключения 2>3.
#endif